/*
 * scopediag.c -- Standalone FPGA scope/acquisition diagnostic firmware
 * FNIRSI 2C53T / AT32F403A @ 240MHz
 *
 * Purpose:
 *   Provide a tiny, repeatable bench tool for answering one question:
 *   can we make the FPGA assert PC0 (data ready) and return nontrivial
 *   SPI3 bytes when we vary boot sequencing, H2 upload, scope params,
 *   and command-3 heartbeat behavior?
 *
 * Controls:
 *   UP   - next preset
 *   PRM  - run selected preset
 *   POWER - abort the active run
 *
 * Build:
 *   make -f Makefile.hwtest TEST=scopediag
 *   make -f Makefile.hwtest TEST=scopediag APP_SLOT=1
 *
 * Flash:
 *   make -f Makefile.hwtest TEST=scopediag flash
 *   make -f Makefile.hwtest TEST=scopediag APP_SLOT=1 flash
 */

#include "at32f403a_407.h"
#include "../drivers/fpga_cal_table.h"
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#ifdef HWTEST_APP_SLOT
#include "dfu_boot.h"
#endif

extern void system_clock_config(void);

#define LCD_CMD   (*(volatile uint16_t *)0x6001FFFE)
#define LCD_DATA  (*(volatile uint16_t *)0x60020000)

#define FPGA_SPI       ((spi_type *)SPI3_BASE)

#define PB6_MASK       (1U << 6)   /* SPI3 CS */
#define PB11_MASK      (1U << 11)  /* FPGA active mode */
#define PC6_MASK       (1U << 6)   /* FPGA SPI enable */

#define SPI3_CS_ASSERT()    (GPIOB->clr = PB6_MASK)
#define SPI3_CS_DEASSERT()  (GPIOB->scr = PB6_MASK)

#define REGION_A_SIZE       87040u
#define RUN_WINDOW_MS       4000u

#define BG     0x0008
#define WHITE  0xFFFF
#define GREEN  0x07E0
#define CYAN   0x07FF
#define YELLO  0xFFE0
#define RED    0xF800
#define GRAY   0x4208
#define ORNG   0xFBE0

enum {
    H2_NONE = 0,
    H2_REGION_A = 1,
    H2_FULL = 2,
};

typedef enum {
    STATUS_IDLE = 0,
    STATUS_RUNNING,
    STATUS_PC0LOW,
    STATUS_NOLOW,
    STATUS_ABORT,
} diag_status_t;

typedef struct {
    uint8_t scope_params[8];   /* 0x01, 0x0B..0x11 */
    uint8_t run_mode;          /* 0x20 */
    uint8_t sample_depth;      /* 0x21 */
    uint8_t tb_prescaler;      /* 0x26 */
    uint8_t tb_period;         /* 0x27 */
    uint8_t tb_mode;           /* 0x28 */
    uint8_t trig_level_lsb;    /* 0x16 */
    uint8_t trig_level_msb;    /* 0x17 */
    uint8_t trig_mode_edge;    /* 0x18 */
    uint8_t trig_holdoff;      /* 0x19 */
    uint8_t range_params[5];   /* 0x1A..0x1E */
    uint8_t mode4_cfg;         /* 0x1F */
    uint8_t mode5_cfg;         /* 0x25 */
    uint8_t start_param;       /* 0x09 */
} scope_bank_t;

typedef struct {
    const char *name;
    uint8_t h2_mode;
    int8_t bank_index;         /* -1 = no scope config */
    bool heartbeat;
    uint16_t heartbeat_ms;
    bool meter_poll;
    uint16_t meter_poll_ms;
    bool runtime_cfg;
    bool meter_tail;
    bool mode_hint;
    bool trigger_cfg;
    bool range_cfg;
    bool mode4_seq;
    bool mode5_seq;
} preset_t;

typedef struct {
    uint32_t run_count;
    uint32_t tx_count;
    uint32_t rx_bytes;
    uint32_t data_frames;
    uint32_t echo_frames;
    uint32_t heartbeat_count;
    uint32_t pc0_low_samples;
    uint32_t h2_bytes_sent;
    uint8_t last_cmd_param;
    uint8_t last_cmd_code;
    uint8_t hs[8];
    uint8_t last_spi[8];
    uint8_t last_data[12];
    uint8_t last_echo[10];
    diag_status_t status;
} diag_state_t;

static diag_state_t diag_state;

static const scope_bank_t scope_banks[] = {
    /* Bank 0: all zeros (current firmware behavior) */
    {
